Revit 2026 API

# DocumentNewPointBoundaryConditions Method

---

Creates a new Point BoundaryConditions Element.

**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public BoundaryConditions NewPointBoundaryConditions(
	Reference reference,
	TranslationRotationValue X_Translation,
	double X_TranslationSpringModulus,
	TranslationRotationValue Y_Translation,
	double Y_TranslationSpringModulus,
	TranslationRotationValue Z_Translation,
	double Z_TranslationSpringModulus,
	TranslationRotationValue X_Rotation,
	double X_RotationSpringModulus,
	TranslationRotationValue Y_Rotation,
	double Y_RotationSpringModulus,
	TranslationRotationValue Z_Rotation,
	double Z_RotationSpringModulus
)
```
```vb
Public Function NewPointBoundaryConditions (
	reference As Reference,
	X_Translation As TranslationRotationValue,
	X_TranslationSpringModulus As Double,
	Y_Translation As TranslationRotationValue,
	Y_TranslationSpringModulus As Double,
	Z_Translation As TranslationRotationValue,
	Z_TranslationSpringModulus As Double,
	X_Rotation As TranslationRotationValue,
	X_RotationSpringModulus As Double,
	Y_Rotation As TranslationRotationValue,
	Y_RotationSpringModulus As Double,
	Z_Rotation As TranslationRotationValue,
	Z_RotationSpringModulus As Double
) As BoundaryConditions
```
```cpp
public:
BoundaryConditions^ NewPointBoundaryConditions(
	Reference^ reference,
	TranslationRotationValue X_Translation,
	double X_TranslationSpringModulus,
	TranslationRotationValue Y_Translation,
	double Y_TranslationSpringModulus,
	TranslationRotationValue Z_Translation,
	double Z_TranslationSpringModulus,
	TranslationRotationValue X_Rotation,
	double X_RotationSpringModulus,
	TranslationRotationValue Y_Rotation,
	double Y_RotationSpringModulus,
	TranslationRotationValue Z_Rotation,
	double Z_RotationSpringModulus
)
```
```fsharp
member NewPointBoundaryConditions :
        reference : Reference *
        X_Translation : TranslationRotationValue *
        X_TranslationSpringModulus : float *
        Y_Translation : TranslationRotationValue *
        Y_TranslationSpringModulus : float *
        Z_Translation : TranslationRotationValue *
        Z_TranslationSpringModulus : float *
        X_Rotation : TranslationRotationValue *
        X_RotationSpringModulus : float *
        Y_Rotation : TranslationRotationValue *
        Y_RotationSpringModulus : float *
        Z_Rotation : TranslationRotationValue *
        Z_RotationSpringModulus : float -> BoundaryConditions
```

#### Parameters

reference Reference
     A Geometry reference to a Beam's, Brace's or Column's analytical line end.
X_Translation TranslationRotationValue
     A value indicating the X axis translation option.
X_TranslationSpringModulus Double
     Translation Spring Modulus for X axis. Ignored if X_Translation is not "Spring".
Y_Translation TranslationRotationValue
     A value indicating the Y axis translation option.
Y_TranslationSpringModulus Double
     Translation Spring Modulus for Y axis. Ignored if Y_Translation is not "Spring".
Z_Translation TranslationRotationValue
     A value indicating the Z axis translation option.
Z_TranslationSpringModulus Double
     Translation Spring Modulus for Z axis. Ignored if Z_Translation is not "Spring".
X_Rotation TranslationRotationValue
     A value indicating the option for rotation about the X axis.
X_RotationSpringModulus Double
     Rotation Spring Modulus for X axis. Ignored if X_Rotation is not "Spring".
Y_Rotation TranslationRotationValue
     A value indicating the option for rotation about the Y axis.
Y_RotationSpringModulus Double
     Rotation Spring Modulus for Y axis. Ignored if Y_Rotation is not "Spring".
Z_Rotation TranslationRotationValue
     A value indicating the option for rotation about the Z axis.
Z_RotationSpringModulus Double
     Rotation Spring Modulus for Z axis. Ignored if Y_Rotation is not "Spring".

#### Return Value

BoundaryConditionsIf successful, NewPointBoundaryConditions returns an object for the newly created BoundaryConditions with the BoundaryType = 0 - "Point".  is returned if the operation fails.

This method will only function with the Autodesk Revit Structure application.

#### Reference

Document Class

Autodesk.Revit.Creation Namespace